nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1186/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB_PDI2CPins_deinit, assigned for the Cortex-M33 core.
 * Description   : This is a de-initialization function for 'BOARD_InitUSB_PDI2CPins' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB_PDI2CPins_deinit(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc1);          /* Turn on LPCG: LPCG is ON. */

  /* GPIO configuration on GPIO_EMC_B2_19 (pin M9) */
  rgpio_pin_config_t gpio3_pinM9_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_19 (pin M9) */
  RGPIO_PinInit(RGPIO3, 29U, &gpio3_pinM9_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_19 (pin M9) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 29U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  /* GPIO configuration on GPIO_EMC_B2_20 (pin M8) */
  rgpio_pin_config_t gpio3_pinM8_config = {
      .pinDirection = kRGPIO_DigitalInput,
      .outputLogic = 0U,
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_PinInit(RGPIO3, 30U, &gpio3_pinM8_config);
  /* Configures GPIO pin interrupt/DMA request on GPIO_EMC_B2_20 (pin M8) */
  RGPIO_SetPinInterruptConfig(RGPIO3, 30U, kRGPIO_InterruptOutput0, kRGPIO_InterruptOrDMADisabled);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 is configured as GPIO3_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 is configured as GPIO3_IO30 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_19_GPIO3_IO29,       /* GPIO_EMC_B2_19 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_20_GPIO3_IO30,       /* GPIO_EMC_B2_20 PAD functional properties : */
      0x08U);                                 /* PDRV Field: high driver
                                                 Pull Down Pull Up Field: PD
                                                 Open Drain Field: Disabled */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
